Clash Bot Webapp Workspace - apply
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Apply 📖`failure`
#### Terraform Validation 🤖`success`

<details><summary>Show Apply</summary>

```

terraform
module.step_function.data.aws_region.current[0]: Reading...
module.step_function.data.aws_caller_identity.current: Reading...
module.step_function.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.step_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.step_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=4239894905]
module.step_function.data.aws_caller_identity.current: Read complete after 0s [id=816923827429]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_route53_zone.this will be created
  + resource "aws_route53_zone" "this" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "clash-bot-workflow-test.api.ninja"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = {
          + "Application" = "ClashBot"
          + "Environment" = "test"
        }
      + zone_id             = (known after apply)
    }

  # module.acm.aws_acm_certificate.this[0] will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "clash-bot-workflow-test.api.ninja"
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "clash-bot-workflow-*.api.ninja",
          + "clash-bot-workflow-test.api.ninja",
        ]
      + tags_all                  = {
          + "Application" = "ClashBot"
          + "Environment" = "test"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "EMAIL"

      + options {
          + certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # module.acm.aws_acm_certificate_validation.this[0] will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn = (known after apply)
      + id              = (known after apply)

      + timeouts {}
    }

  # module.api_gateway.aws_apigatewayv2_api.this[0] will be created
  + resource "aws_apigatewayv2_api" "this" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + description                  = "Clash Bot Workflow API Gateway for the test environment"
      + disable_execute_api_endpoint = false
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "clash-bot-workflow-test"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = {
          + "Application" = "ClashBot"
          + "Environment" = "test"
        }

      + cors_configuration {
          + allow_headers = [
              + "authorization",
              + "content-type",
              + "x-amz-date",
              + "x-amz-security-token",
              + "x-amz-user-agent",
              + "x-api-key",
            ]
          + allow_methods = [
              + "*",
            ]
          + allow_origins = [
              + "*",
            ]
        }
    }

  # module.api_gateway.aws_apigatewayv2_api_mapping.this[0] will be created
  + resource "aws_apigatewayv2_api_mapping" "this" {
      + api_id      = (known after apply)
      + domain_name = (known after apply)
      + id          = (known after apply)
      + stage       = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_domain_name.this[0] will be created
  + resource "aws_apigatewayv2_domain_name" "this" {
      + api_mapping_selection_expression = (known after apply)
      + arn                              = (known after apply)
      + domain_name                      = "clash-bot-workflow-test.api.ninja"
      + id                               = (known after apply)
      + tags_all                         = {
          + "Application" = "ClashBot"
          + "Environment" = "test"
        }

      + domain_name_configuration {
          + certificate_arn                        = (known after apply)
          + endpoint_type                          = "REGIONAL"
          + hosted_zone_id                         = (known after apply)
          + ownership_verification_certificate_arn = (known after apply)
          + security_policy                        = "TLS_1_2"
          + target_domain_name                     = (known after apply)
        }
    }

  # module.api_gateway.aws_apigatewayv2_integration.this["$default"] will be created
  + resource "aws_apigatewayv2_integration" "this" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "MOCK"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_route.this["$default"] will be created
  + resource "aws_apigatewayv2_route" "this" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "$default"
      + target             = (known after apply)
    }

  # module.api_gateway.aws_apigatewayv2_stage.default[0] will be created
  + resource "aws_apigatewayv2_stage" "default" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "$default"
      + tags_all      = {
          + "Application" = "ClashBot"
          + "Environment" = "test"
        }
    }

  # module.dynamodb_table.aws_dynamodb_table.this[0] will be created
  + resource "aws_dynamodb_table" "this" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "teamId"
      + id               = (known after apply)
      + name             = "clash-teams-test"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_enabled   = false
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Name" = "clash-teams-test"
        }
      + tags_all         = {
          + "Application" = "ClashBot"
          + "Environment" = "test"
          + "Name"        = "clash-teams-test"
        }
      + write_capacity   = 5

      + attribute {
          + name = "teamId"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = false
        }

      + server_side_encryption {
          + enabled     = false
          + kms_key_arn = (known after apply)
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "60m"
        }

      + ttl {
          + enabled = false
        }
    }

  # module.step_function.data.aws_iam_policy_document.service["dynamodb"] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "service" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:DeleteItem",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "dynamodbDynamodb"
        }
    }

  # module.step_function.aws_iam_policy.service["dynamodb"] will be created
  + resource "aws_iam_policy" "service" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "retrieve-teams-test-dynamodb"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Application" = "ClashBot"
          + "Environment" = "test"
        }
    }

  # module.step_function.aws_iam_policy_attachment.service["dynamodb"] will be created
  + resource "aws_iam_policy_attachment" "service" {
      + id         = (known after apply)
      + name       = "retrieve-teams-test-dynamodb"
      + policy_arn = (known after apply)
      + roles      = [
          + "retrieve-teams-test",
        ]
    }

  # module.step_function.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.us-east-1.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "retrieve-teams-test"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Application" = "ClashBot"
          + "Environment" = "test"
        }
      + unique_id             = (known after apply)
    }

  # module.step_function.aws_sfn_state_machine.this[0] will be created
  + resource "aws_sfn_state_machine" "this" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = <<-EOT
            {
                "Comment": "A Hello World example of the Amazon States Language using Pass states",
                "StartAt": "Hello",
                "States": {
                  "Hello": {
                    "Type": "Pass",
                    "Result": "Hello",
                    "Next": "World"
                  },
                  "World": {
                    "Type": "Pass",
                    "Result": "World",
                    "End": true
                  }
                }
              }
        EOT
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "retrieve-teams-test"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Name" = "retrieve-teams-test"
        }
      + tags_all                  = {
          + "Application" = "ClashBot"
          + "Environment" = "test"
          + "Name"        = "retrieve-teams-test"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)

      + timeouts {}
    }

Plan: 14 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + clash-teams-table-arn = (known after apply)
module.dynamodb_table.aws_dynamodb_table.this[0]: Creating...
module.acm.aws_acm_certificate.this[0]: Creating...
module.api_gateway.aws_apigatewayv2_api.this[0]: Creating...
aws_route53_zone.this: Creating...
module.step_function.aws_iam_role.this[0]: Creating...
module.api_gateway.aws_apigatewayv2_api.this[0]: Creation complete after 1s [id=m5meowafv2]
module.dynamodb_table.aws_dynamodb_table.this[0]: Creation complete after 6s [id=clash-teams-test]
module.step_function.data.aws_iam_policy_document.service["dynamodb"]: Reading...
module.step_function.data.aws_iam_policy_document.service["dynamodb"]: Read complete after 0s [id=698694724]
module.step_function.aws_iam_policy.service["dynamodb"]: Creating...
aws_route53_zone.this: Still creating... [10s elapsed]
aws_route53_zone.this: Still creating... [20s elapsed]
aws_route53_zone.this: Still creating... [30s elapsed]
aws_route53_zone.this: Still creating... [40s elapsed]
aws_route53_zone.this: Still creating... [50s elapsed]
aws_route53_zone.this: Creation complete after 55s [id=Z05659833F9SYO5DQD39U]

```

</details>

*Pushed by: @Poss111, Action: `pull_request`*